In [2]:
import sqlite3

In [3]:
connexion = sqlite3.connect("toutroule.db")

In [3]:
curseur = connexion.cursor()

In [4]:
creation_table = """
CREATE TABLE vehicules(
   id_vehicule INTEGER PRIMARY KEY,
   type VARCHAR(50) NOT NULL
);
"""

In [5]:
curseur.execute(creation_table)

In [6]:
table_chauffeur = """
CREATE TABLE chauffeurs(
   id_chauffeur INTEGER PRIMARY KEY,
   nom VARCHAR(50) NOT NULL,
   prenom VARCHAR(50) NOT NULL,
   genre VARCHAR(2) NOT NULL
);
"""

In [7]:
curseur.execute(table_chauffeur)

In [8]:
table_trajets = """
CREATE TABLE trajets(
   id_trajet INTEGER PRIMARY KEY,
   km_fin INT NOT NULL,
   km_debut INT NOT NULL,
   commentaire VARCHAR(250),
   id_vehicule CHAR(50) NOT NULL,
   id_chauffeur INT NOT NULL,
   FOREIGN KEY(id_vehicule) REFERENCES vehicule(id_vehicule),
   FOREIGN KEY(id_chauffeur) REFERENCES chauffeurs(id_chauffeur)
);
"""

In [9]:
curseur.execute(table_trajets)

In [10]:
connexion.commit()
connexion.close()

In [5]:
connexion = sqlite3.connect("toutroule.db")
curseur = connexion.cursor()
f_prenom = curseur.execute("SELECT prenom FROM chauffeurs WHERE nom = ?", ("Mouré",))
f_prenom = [(resultat[0], resultat[0]) for resultat in f_prenom]
f_prenom

[('Antoine', 'Antoine'), ('Antoine', 'Antoine')]

In [10]:
import sqlite3
import pandas as pd

con = sqlite3.connect('toutroule.db')
cursor = con.cursor()
cursor.execute('''SELECT
    c.id_chauffeur,
    c.nom,
    c.prenom,
    c.genre,
    v.id_vehicule,
    v.type,
    t.id_trajet,
    t.km_debut,
    t.km_fin,
    t.commentaire
FROM
    trajets as t
    JOIN chauffeurs as c ON t.id_chauffeur = c.id_chauffeur
    JOIN vehicules as v ON t.id_vehicule = v.id_vehicule''')  
#===============================================================
# Récupérez toutes les lignes dans un DataFrame
df = pd.DataFrame(cursor.fetchall(), columns=[  
    'id_chauffeur',
    'nom',
    'prenom',
    'genre',
    'id_vehicule',
    'type',
    'id_trajet',
    'km_debut',
    'km_fin',
    'commentaire'
])


con.close() 
df

,id_chauffeur,nom,prenom,genre,id_vehicule,type,id_trajet,km_debut,km_fin,commentaire
0,1,Mer,Lou,M,1,camion citerne,1,800,600,
1,1,Mer,Lou,M,3,camion benne,2,900,1000,
2,1,Mer,Lou,M,1,camion citerne,3,5200,5260,
3,1,Mer,Lou,M,1,camion citerne,4,5500,5540,
4,1,Mer,Lou,M,1,camion citerne,5,5500,5540,
5,1,Mer,Lou,M,1,camion citerne,6,5500,5540,
6,1,Mer,Lou,M,1,camion citerne,7,5500,5540,
7,1,Mer,Lou,M,1,camion citerne,8,5500,5540,
8,1,Mer,Lou,M,1,camion citerne,9,5500,5540,
9,1,Mer,Lou,M,1,camion citerne,10,5500,5540,
10,1,Mer,Lou,M,1,camion citerne,11,5500,5540,
11,1,Mer,Lou,M,1,camion citerne,12,5500,5540,
12,1,Mer,Lou,M,1,camion citerne,13,5500,5540,
13,1,Mer,Lou,M,1,camion citerne,14,5500,5540,
14,1,Mer,Lou,M,1,camion citerne,15,5500,5540,
15,1,Mer,Lou,M,1,camion citerne,16,5500,5540,
16,1,Mer,Lou,M,1,camion citerne,17,5500,5540,
17,1,Mer,Lou,M,1,camion citerne,18,5500,5540,
18,1,Mer,Lou,M,1,camion citerne,19,5500,5540,
19,1,Mer,Lou,M,1,camion citerne,20,5500,5540,
20,1,Mer,Lou,M,1,camion citerne,21,5500,5540,
21,1,Mer,Lou,M,1,camion citerne,22,5500,5540,
22,1,Mer,Lou,M,1,camion citerne,23,5500,5540,
23,1,Mer,Lou,M,2,camion frigorifique,24,54200,54300,
24,1,Mer,Lou,M,1,camion citerne,25,45000,45200,
25,3,Mouré,Antoine,M,3,camion benne,26,5400,5420,

In [11]:
df_identite = df[["nom", "prenom",'genre']].drop_duplicates()
df_identite

      nom   prenom genre
0     Mer      Lou     M
25  Mouré  Antoine     M

In [5]:
connexion = sqlite3.connect("toutroule.db")
curseur = connexion.cursor()
curseur.execute("UPDATE chauffeurs SET nom=?, prenom=?, genre=? WHERE nom=? and prenom=?", ("Mer", "Lou", "F", "Mer","Lou"))
# curseur.execute("UPDATE INTO chauffeurs (nom, prenom, genre) VALUES (?, ?, ?)", (f_nom, f_prenom, f_genre))
connexion.commit()